app/controllers/api/v1/events_controller.rb

INSERT INTO "events" ("name", "description", "cover", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "The Royal Wedding"], ["description", "Prince Harry and Meghan Markle"], ["cover", nil], ["created_at", "2018-07-04 20:57:03.486941"], ["updated_at", "2018-07-04 20:57:03.486941"]]
UPDATE "events" SET "updated_at" = ? WHERE "events"."id" = ?  [["updated_at", "2018-08-29 18:02:09.860255"], ["id", 7]]
---
  def create
    @event = Event.create! params.require(:event).permit(:name, :description)
    @event.cover.attach(params[:event][:cover])

    if @event.save

UPDATE "events" SET "updated_at" = ? WHERE "events"."id" = ?  [["updated_at", "2018-10-18 18:32:53.657411"], ["id", 4]]
---
  def update
    if @event.update(event_params)