app/controllers/api/v1/photos_controller.rb

INSERT INTO "photos" ("event_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["event_id", 1], ["created_at", "2018-10-15 21:28:11.994110"], ["updated_at", "2018-10-15 21:28:11.994110"]]
---
  def create
    @photo = Photo.new(photo_params)

    if @photo.save